[Battery.WhaleOilBattery_BendTime_twk DisDLC05Tweaks_WhaleOilBattery]
m_EmptyName="空油罐"

[Battery.WhaleOilBattery_BendTime_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name="鲸油罐"
m_InteractText=" `GBA_Use` 搬运"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Battery.WhaleOilBattery_DarkVision_twk DisDLC05Tweaks_WhaleOilBattery]
m_EmptyName="空油罐"

[Battery.WhaleOilBattery_DarkVision_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name=""
m_InteractText=""
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Battery.WhaleOilBattery_Health_twk DisDLC05Tweaks_WhaleOilBattery]
m_EmptyName="空油罐"

[Battery.WhaleOilBattery_Health_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name=""
m_InteractText=""
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Battery.WhaleOilBattery_Normal_twk DisDLC05Tweaks_WhaleOilBattery]
m_EmptyName="空油罐"

[Battery.WhaleOilBattery_Normal_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name=""
m_InteractText=""
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Battery.WhaleOilBattery_Smoke_twk DisDLC05Tweaks_WhaleOilBattery]
m_EmptyName="空油罐"

[Battery.WhaleOilBattery_Smoke_twk:pInteractableTweaks DisTweaks_InteractableInterface]
m_Name=""
m_InteractText=""
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage=""

[Notes.DisclaimerNormal_AbstrInv DisAbstractItem]
m_ItemName="油罐倾落"
m_PluralItemName=""
m_Description="尽可能多地射击落下的鲸油罐。\n \n你有一把完全升级的手枪和无限子弹。\n\n得分：\n* 每击碎一个油罐都会得到相应的分数。\n*同时击碎多个油罐可以得到额外的分数奖励。\n*击碎全部油罐可以得到额外的分数奖励。\n*高精准度可以得到额外的分数奖励。\n\n特别提示:\n有以下几种鲸油罐：\n* 普通油罐\n*紫色油罐：射击时产生一团烟雾\n*金色油罐：时间减慢2秒\n*绿色油罐：开启黑暗视野15秒\n*粉色油罐：恢复35%的生命\n \n任务结束：\n如果你死亡，任务结束"

[Notes.DisclaimerNormal_Pickup DisTweaks_AbstractItemPickupNote]
m_PressKeyToReadMessage=""
m_OnPickupMessage=""

[Twk_Inv_PistolOilRain:DisTweaks_InventoryItem_PlayerSpecific_0 DisTweaks_InventoryItem_PlayerSpecific]
m_Name="科尔沃的手枪"
m_Description="由大师精工打造，且充分考虑了定制需求，这是整个群岛上最顶级的火器。可升级手枪，并增加近距离散射伤害。"

[Twk_Proj_BulletOilRain:DisTweaks_InteractableInterface_2 DisTweaks_InteractableInterface]
m_Name="子弹"
m_InteractText="轻按 `k 拾起"
m_AltInteractText=""
m_UseMessage=""
m_AltUseMessage=""
m_CannotUseMessage="你不能再携带更多这种弹药了"

